<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python53_concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import numpy as np
import pandas as pd

# pandas.Series의 concat

In [2]:
s1 = pd.Series(data=[1, 2], index=['a', 'b'])
s1

a    1
b    2
dtype: int64

In [5]:
s2 = pd.Series(data=[3, 4, 5], index=['c', 'd', 'e'])
s2

c    3
d    4
e    5
dtype: int64

In [7]:
pd.concat([s1, s2])  # axis=0: 기본값

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
pd.concat([s1, s2], axis=1)

     0    1
a  1.0  NaN
b  2.0  NaN
c  NaN  3.0
d  NaN  4.0
e  NaN  5.0

In [9]:
s3 = pd.Series(data=[3, 4, 5], index=['a', 'b', 'c'])
s3

a    3
b    4
c    5
dtype: int64

In [16]:
pd.concat([s1, s3], axis=0)

a    1
b    2
a    3
b    4
c    5
dtype: int64

In [11]:
pd.concat([s1, s3], axis=1)

     0  1
a  1.0  3
b  2.0  4
c  NaN  5

# pandas.DataFrame의 concat

In [19]:
df1 = pd.DataFrame(data=np.arange(6).reshape((3, 2)),
                   index=['a', 'b', 'c'],
                   columns=['data1', 'data2'])
df1

   data1  data2
a      0      1
b      2      3
c      4      5

In [21]:
df2 = pd.DataFrame(data=np.arange(4).reshape((2, 2)),
                   index=['a', 'c'],
                   columns=['data2', 'data3'])
df2

   data2  data3
a      0      1
c      2      3

In [22]:
pd.concat([df1, df2], axis=0)

   data1  data2  data3
a    0.0      1    NaN
b    2.0      3    NaN
c    4.0      5    NaN
a    NaN      0    1.0
c    NaN      2    3.0

In [23]:
pd.concat([df1, df2], axis=1)

   data1  data2  data2  data3
a      0      1    0.0    1.0
b      2      3    NaN    NaN
c      4      5    2.0    3.0

In [27]:
df1 = pd.DataFrame(data=np.arange(12).reshape((3, 4)))
df2 = pd.DataFrame(data=np.arange(12, 24).reshape((3, 4)))
pd.concat([df1, df2], ignore_index=True)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23

https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/babynames/ 폴더에는 1880년 ~ 2010년까지의 미국 신생아들의 이름, 성별, 개수가 기록되어 있습니다.
1. 텍스트 파일을 하나씩 읽어서 데이터 프레임을 생성하세요.
2. 각 데이터 프레임에 year 컬럼을 추가하세요.
3. 131개의 데이터 프레임들을 하나의 데이터 프레임으로 병합(concat)하세요.

In [13]:
file_path = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/babynames/yob2000.txt'
df = pd.read_csv(file_path, header=None, names=['name', 'gender', 'count'])
df

          name gender  count
0        Emily      F  25949
1       Hannah      F  23066
2      Madison      F  19965
3       Ashley      F  17991
4        Sarah      F  17677
...        ...    ...    ...
29753     Zeph      M      5
29754    Zeven      M      5
29755    Ziggy      M      5
29756       Zo      M      5
29757    Zyier      M      5

[29758 rows x 3 columns]

In [18]:
years = range(1880, 2011)  # 연도 - 파일 이름 끝(접미사), 데이터 프레임의 year 컬럼 값.
col_names = ['name', 'gender', 'count']  # 데이터 프레임의 컬럼 이름
year_of_births = []

for year in years:
    file_path = f'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/babynames/yob{year}.txt'
    # print(file_path)
    df = pd.read_csv(file_path, header=None, names=col_names)
    df['year'] = year
    # print(df.iloc[:5])
    year_of_births.append(df)
    
print(len(year_of_births))

131

In [20]:
yob_data = pd.concat(year_of_births, ignore_index=True)
yob_data

              name gender  count  year
0             Mary      F   7065  1880
1             Anna      F   2604  1880
2             Emma      F   2003  1880
3        Elizabeth      F   1939  1880
4           Minnie      F   1746  1880
...            ...    ...    ...   ...
1690779    Zymaire      M      5  2010
1690780     Zyonne      M      5  2010
1690781  Zyquarius      M      5  2010
1690782      Zyran      M      5  2010
1690783      Zzyzx      M      5  2010

[1690784 rows x 4 columns]